#+title: Contents

Brief table of contents and todo list.

*** Rough Version
Should have columns for each year, with "Preferred Labels" and "Aggregate Labels".   Labels for different years:
#+begin_src python :results output raw table
from lsms.tools import from_dta
import dvc.api
import pyreadstat
from pathlib import Path


Country = str(Path().resolve().parent).split('/')[-1]

itemlabel_location = {'2008':('05alimentos.dta','producto'),
                      '2003':('E03GA10B.DTA','gai00'),
                      '1997':('GAST-A.DTA','ga100')}


reference_year = list(itemlabel_location.keys())[0]

fs = dvc.api.DVCFileSystem('../../')

itemlabels = {}
for k,v in itemlabel_location.items():
    fs.get_file(f'/{Country}/{k}/Data/{v[0]}',f'/tmp/{v[0]}')
    df, meta = pyreadstat.read_dta(f'/tmp/{v[0]}')
    try:
        itemlabels[k] = list(meta.value_labels[v[1]].values())
    except KeyError:
        itemlabels[k] = df[v[1]].astype(int).astype(str).value_counts().sort_index().index.tolist()

#print(itemlabels)

# Build dictionary of dictionaries for matching
from collections import defaultdict
import difflib
import pandas as pd
from cfe.df_utils import df_to_orgtbl

D = defaultdict(dict)
D.update({k:{'Preferred Label':k.title()} for k in itemlabels[reference_year]})

for wave in itemlabel_location.keys():
    for l in itemlabels[wave]:
        k = difflib.get_close_matches(l,itemlabels[reference_year])
        if len(k):
            D[k[0]][wave] = l
        else:
            D[l][wave] = l

df = pd.DataFrame(D).T.set_index('Preferred Label')

print(df_to_orgtbl(df))
#+end_src

#+results:
| Preferred Label                                        | 2008                                                   | 2003                      | 1997 |
|--------------------------------------------------------+--------------------------------------------------------+---------------------------+------|
| Leche En Polvo                                         | leche en polvo                                         | Leche en polvo            | ---  |
| Leche Líquida                                          | leche líquida                                          | Leche Líquida             | ---  |
| Lecha Evaporada                                        | lecha evaporada                                        | Leche Evaporada           | ---  |
| Queso (Balnco Y Amarillo)                              | queso (balnco y amarillo)                              | Queso (Blanco y Amarillo) | ---  |
| Huevos De Gallina                                      | huevos de gallina                                      | Huevos de Gallina         | ---  |
| Carne De Res                                           | carne de res                                           | Carne de res              | ---  |
| Viscera De Res                                         | viscera de res                                         | Vísceras de res           | ---  |
| Carnes De Puerco                                       | carnes de puerco                                       | Carnes de puerco          | ---  |
| Pollo O Gallina                                        | pollo o gallina                                        | Pollo o gallina           | ---  |
| Visceras De Pollo O Gallina                            | visceras de pollo o gallina                            | Víscera de pollo          | ---  |
| Embutidos (Jamón, Mortadela, Salchichas...)            | embutidos (jamón, mortadela, salchichas...)            | ---                       | ---  |
| Pescados                                               | pescados                                               | Pescados                  | ---  |
| Mariscos (Camarones, ...)                              | mariscos (camarones, ...)                              | Mariscos (camarones)      | ---  |
| Sardina Y Atún (Tuna)                                  | sardina y atún (tuna)                                  | Sardina y Atún            | ---  |
| Lentejas                                               | lentejas                                               | Lenteja                   | ---  |
| Porotos                                                | porotos                                                | Porotos                   | ---  |
| Frijoles                                               | frijoles                                               | Frijoles                  | ---  |
| Arvejas Amarillas Y Verdes                             | arvejas amarillas y verdes                             | ---                       | ---  |
| Pan De Sal Y Pan De Dulce                              | pan de sal y pan de dulce                              | Pan de sal y dulce        | ---  |
| Galletas / Pasteles Y Dulces                           | galletas / pasteles y dulces                           | Galletas / Dulces         | ---  |
| Arroz(Todos)                                           | arroz(todos)                                           | ---                       | ---  |
| Maíz De Grano                                          | maíz de grano                                          | Maíz en grano             | ---  |
| Maíz De Mazorca                                        | maíz de mazorca                                        | Maíz en mazorca           | ---  |
| Preparación De Maíz                                    | preparación de maíz                                    | Preparados de maíz        | ---  |
| Cereales Y Cremas                                      | cereales y cremas                                      | Cereales y cremas         | ---  |
| Harina De Trigo                                        | harina de trigo                                        | Harina de trigo           | ---  |
| Pastas Alimenticias (Coditos, Macarrones, ...)         | pastas alimenticias (coditos, macarrones, ...)         | ---                       | ---  |
| Azúcar (Blanca Y Morena)                               | azúcar (blanca y morena)                               | ---                       | ---  |
| Panela, Raspadura, Etc                                 | panela, raspadura, etc                                 | Panela, raspadura         | ---  |
| Miel                                                   | miel                                                   | Miel                      | ---  |
| Aceite Vegetal                                         | aceite vegetal                                         | Aceite vegetal            | ---  |
| Manteca                                                | manteca                                                | Manteca                   | ---  |
| Mantequilla                                            | mantequilla                                            | Mantequilla               | ---  |
| Margarina                                              | margarina                                              | Margarina                 | ---  |
| Mayonesa                                               | mayonesa                                               | Mayonesa                  | ---  |
| Ajo                                                    | ajo                                                    | Ajo                       | ---  |
| Culanto, Perejil, Cebollina                            | culanto, perejil, cebollina                            | Culantro, perejil         | ---  |
| Tomate                                                 | tomate                                                 | Tomate                    | ---  |
| Cebolla                                                | cebolla                                                | Cebolla                   | ---  |
| Ahí Verde, Pimiento Y Picantes                         | ahí verde, pimiento y picantes                         | Ají verde, pimiento       | ---  |
| Repollo                                                | repollo                                                | Repollo                   | ---  |
| Zanahoria                                              | zanahoria                                              | Zanahoria                 | ---  |
| Zapallo / Chayote                                      | zapallo / chayote                                      | Zapallo / Challote        | ---  |
| Lechuga                                                | lechuga                                                | Lechuga                   | ---  |
| Pepino                                                 | pepino                                                 | Pepino                    | ---  |
| Remolacha                                              | remolacha                                              | Remolacha                 | ---  |
| Apio                                                   | apio                                                   | Apio                      | ---  |
| Papas                                                  | papas                                                  | Papas                     | ---  |
| Ñame                                                   | Ñame                                                   | Ñame                      | ---  |
| Yuca                                                   | yuca                                                   | Yuca                      | ---  |
| Otoes                                                  | otoes                                                  | Otoes                     | ---  |
| Plátanos Verdes Y/O Maduros                            | plátanos verdes y/o maduros                            | ---                       | ---  |
| Cocos (Pipas)                                          | cocos (pipas)                                          | ---                       | ---  |
| Guineos (Bananos)                                      | guineos (bananos)                                      | ---                       | ---  |
| Naranjas                                               | naranjas                                               | Naranjas                  | ---  |
| Piñas                                                  | piñas                                                  | Piñas                     | ---  |
| Manzanas                                               | manzanas                                               | Manzanas                  | ---  |
| Aguacates                                              | aguacates                                              | Aguacate                  | ---  |
| Melones                                                | melones                                                | Melones                   | ---  |
| Sandias                                                | sandias                                                | Sandías                   | ---  |
| Mangos                                                 | mangos                                                 | Mangos                    | ---  |
| Limones                                                | limones                                                | Limones                   | ---  |
| Papayas                                                | papayas                                                | Papayas                   | ---  |
| Alimento Infantil                                      | alimento infantil                                      | Alimento Infantil         | ---  |
| Sopa Enlatada Y En Sobres                              | sopa enlatada y en sobres                              | Enlatados y envasados     | ---  |
| Pastas De Tomate Y Salsas De Tomate                    | pastas de tomate y salsas de tomate                    | ---                       | ---  |
| Condimentos (Orégano, Pimienta, ...)                   | condimentos (orégano, pimienta, ...)                   | ---                       | ---  |
| Sal                                                    | sal                                                    | Sal                       | ---  |
| Sodas, Refrescos Y Jugos                               | sodas, refrescos y jugos                               | Sodas y refrescos         | ---  |
| Helados                                                | helados                                                | Helados                   | ---  |
| Raspados Y Duros                                       | raspados y duros                                       | Raspados y duros          | ---  |
| Café Y Té                                              | café y té                                              | Café y té                 | ---  |
| Enlatados Y Envasados (Maíz, Frijoles, Vegetales, ...) | enlatados y envasados (maíz, frijoles, vegetales, ...) | ---                       | ---  |
| Pastillas Y Confites                                   | pastillas y confites                                   | Pastillas y confites      | ---  |
| Chocolates                                             | chocolates                                             | Chocolates                | ---  |
| Picaritas, Menitos, Snacks, Etc                        | picaritas, menitos, snacks, etc                        | Picaritas, snacks         | ---  |
| Gelatinas, Pudines, Postres Y Mermeladas               | gelatinas, pudines, postres y mermeladas               | ---                       | ---  |
| Cervezas                                               | cervezas                                               | Cerveza                   | ---  |
| Licores Varios                                         | licores varios                                         | Licores varios            | ---  |
| Cigarrillo Y Tabaco                                    | cigarrillo y tabaco                                    | Cigarrillo y Tabaco       | ---  |
| Otros                                                  | otros                                                  | Cocos                     | ---  |


